import random
from telegram.ext import run_async, Filters
from telegram import Message, Chat, Update, Bot, MessageEntity
from buddy import dispatcher
from buddy.modules.disable import DisableAbleCommandHandler

ABUSE_STRINGS = (
    "வாய மூடிட்டு போடா வெண்ண... 😤",
    "சும்மா இருடா வெண்ண 😤",
    "ஏதாவது சொல்லிர போறன் 🤬",
    "ஷட் அப் மேன் 😷",
    "மூஞ்ச பாரு 🤮",
    "அட ச்சீ ப்பே 👊🏻",
    "டம்மி பாவா 🥴",
    "சோதிக்காதீங்கடா என்னைய 🤐",
    "ஒலுங்கா ஓடிரு 🤜🏻",
    "சிம்ப்ளி வேஸ்ட் 🙄",
    "என்ன திட்றது தெரியல 💁🏻‍♀️",
    "வாயில நல்லா வரும் 🤬",
    "அடிங்கு கொய்யால 👊🏻",
    "நா எவ்ளோ நல்ல புள்ள தெரியுமா? 🙈",
    "யு கோ மேன் வை மீ 💁🏻‍♀️"
    "குருநாதா! இதுக்கு மேல தாங்க முடியாது குருநாதா... 🥶🤬",
    "வந்தன்னு வெய் அவ்ளோதான் பாத்துக்க 😠",
    "இப்போ என்னவாம்... 😏",
    "ரத்தம் கக்கி சாவு 🙊",
    "இஞ்சி தின்ன கொரங்கு மாறி இருக்க 🐵",
    "ஃப்ராடு தான நீ 😁",
    "இது எல்லாம் ஒரு பொழப்பு 🥵 போய் பிச்சை எடு போ",
    "ஓ! இது தான் அனியாயத்த கண்டா பொங்குறதா?😁",
    "ஜிஞ்சர் ஈட்டிங்க் மங்க்கி 🐵",
    "வெட்கமே இல்லையா உனக்கு -த்து 💦😂",
    "இப்போ என்னவாம்... 😏",
    "மூடிட்டு போடா வெண்ண! 😂",
    "காதல் ஒரு காத்து போன பலூன் 😂",
    "நீ மங்குனி அமைச்சர் என்பதை மணிக்கு ஒருமுறை நிரூபித்துக் கொண்டே இருக்கிறாய்! 😂",
    "க்ரீன் க்ரீனா திட்டிருவன் 🤬",
    "வேணா சொல்றத கேளு, சொன்னா கேளு வேணா அப்புறம் அழுதுருவ 😢",
    "போடா 🐖 பண்ணி",
    "என்னப்பா உனக்கு பிரச்சன? 😣",
    "போடா 🦊 நரி",
    "மண்ட பத்திரம்.🔨⛏",
    "எனக்கு தெரியாது ப்பே 😜",
    "இஞ்சி தின்ன கொரங்கு மாறி இருக்க 🐵",
    "அடிங்கு ஓடி போ நாயே! 🐕",
    "ஒரே அடி தான் நீ காலி 😏",
    "போடா 🐕 நாயே!",
    "என்ன குழந்தாய் 😆... வாங்குனது பத்தாதா?",
    "புள்ள குட்டிய படிக்க வெய் போ... 😆",
    "நீ ஒரு டுபாக்கூர் 😝",
    "நீ பெரிய முட்டாள்னு எனக்கு எப்பயோ தெரியும்! 😜",
    "லெஃப்ட்ல விட்டா ரைட்ல திரும்பிக்கும் 👊🏻",
    "மூஞ்ச பாரு மூஞ்செலி வாயா 😂",
    "நீந்தாண்ட அது டுபுக்கு 😜",
    "இப்போ என்னவாம்... 😏",
    "காதலும் கத்திரிக்காயும், போயா வேலைய பாத்துட்டு 😒",
    "மூஞ்சியும், மொகரகட்டையும், ஆள பாரு 🙄",
    "உன்ன ரொம்ப நல்லவன்னு சொல்லிக்கிறாங்க ஊர்ல 😁!",
    "அவ்வ்வ்வ்வ்வ்வ்வ்வ்வ்வ்வ்வ்வ்வ்வ்!!! 🥴",
    "நரி ஊல வீற்றிச்சுடோய்!! 🏃🏻"
  )

SONG_STRINGS = (
    "🎼ஏதோ ஒன்று ஏதோ ஒன்று உன்னை கேட்பேன் இல்லை என்றால் இல்லை என்றால் உயிர் துறப்பேன்🎼",
	"🎼அடியே அடியே... என் குட்டி பட்டாசே!! தனியே தனியே... வந்து விட்டு வெளாசே!!🎼",
	"🎼அஸ்கு மாரோ அஸ்கு மாரோ... அல்டிமேட்டு நம்ம பேரோ!!🎼",
	"🎼உன்னால உன்னால எல்லாமே உன்னால.. ஓகேனு சொன்னாலே கெத்தாவேன் தன்னால🎼",
	"🎼கண்ணாலே பேசி பேசி கொல்லாதே.. காதாலே கேட்டு கேட்டு செல்லாதே🎼",
	"🎼எந்தன் நண்பியே நண்பியே.. எனை திறக்கும் அன்பியே...🎼",
	"🎼எந்தன் மனம் பார்க்க சொல்வதெல்லாம் கேக்க கிடைத்த ஓர் உயிர் துணை நீயே நீயே🎼",
	"🎼நான் இங்கு உண்மையா? உன் கையில் பொம்மையா? யார் இந்த நான் என சொன்னாயே!!🎼",
	"🎼மழை வீழும் இள மாலையோ இசையில்லா இடைவேளையோ.. என்னோடு நீ நடந்தால் இன்பம் என் உலகு..🎼",
	"🎼என் இனிய தனிமையே🚶🚶‍♀️🚶🚶‍♀️🚶🚶‍♀️ என் இனிய தனிமையே🚶🚶‍♀️🚶🚶‍♀️🚶🚶‍♀️🎼",
	"🎼ஒரு சிலர் என்னை நெருங்க என்னிடம் பேச தொடங்க சிறு ஊடல் கொண்டு நீங்கி போகின்றாய்😔😔😔🎼",
	"🎼குக்கூ குக்கூ தாத்தா தாத்தா களவெட்டி குக்கூ குக்கூ பொந்துல யாரு மீன் கொத்தி🎼",
	"🎼நீ இல்லை என்றால் எனக்கென யாரும் இல்லையே!! ஏன் இதை செய்தாய்? துணை என யாருமே இல்லையே!!🎼",
	"🎼சற்று முன்பு பார்த்த மேகம் மாறி போக காலம் இன்று காதல் நெஞ்சை கீறி போக🎼",
	"🎼முதலும் ஒரு முடிவும் என் வாழ்வில் நீதானே நிலவாக உன்னை வானில் பார்த்தேன் அலையாக ...🎼",
	"🎼பூகம்பம் வந்தாலும் அசராதே கண்மணி எந்நாளும் உன் நினைவில் நான் இங்கே பெண்மணி🎼",
	"🎼காதல் நீ தானா காதல் நீ தானா உன்னைக் காணத்தான் கண்கள் கொண்டேனா தெரிந்ததே உன் முகம் ...🎼",
	"🎼கண்ணில் கையில் தந்தவள் நீதானே ஆனால் பெண்ணே நெஞ்சை மட்டும் மூடி வைத்தாயோ🎼",
	"🎼மறுவார்த்தை பேசாதே மடி மீது நீ தூங்கிடு இமை போல நான் காக்க கனவாய் நீ மாறிடு🎼",
	"🎼நேற்று முன்னிரவில் உன் நித்திலப்பூ மடியில் காற்று நுழைவது போல் உயிர் கலந்து🎼",
	"🎼எனக்கொரு சினேகிதி சினேகிதி தென்றல் மாதிரி நீ ஒரு பௌர்னமி பௌர்னமி🎼",
	"🎼என்னை விட்டு செல்லாதே எந்த அன்பே!!! வேண்டும் உன் காதல் ஒன்றே!!🎼",
	"🎼உன்னை மட்டும் நேசித்தேன் இது உண்மை!!! இன்னும் ஏன் இந்த ஊடல்!!🎼",
	"🎼அழகே அழகே அழகின் அழகே நீயடி உன் அருகே அருகே அழகாய் தொலைந்தேன் நானடி..!!🎼",
	"🎼தனியாக தவிக்கின்றேன் துணை வேண்டாம் அன்பே போ... பிணமாக நடக்கின்றேன் உயிர் வேண்டாம் தூரம் போ🎼",
	"🎼கண்ண மூடி கண்ட கனவே பல ஜென்மம் தாண்டி வந்த உறவே🎼",
	"🎼உயிரே என் உறவே உனை விட்டு போவதும் சாவதும் ஒன்று தான்🎼",
	"🎼இரவா பகலா குளிரா வெயிலா என்னை ஒன்றும் செய்யாதடி கடலா புயலா இடியா மழையா என்னை ஒன்றும் செய்யாதடி ஆனால் உந்தன் மௌனம் மட்டும்🎼",
	"🎼அன்பே அன்பே நீ என் பிள்ளை தேகம் மட்டும் காதல் இல்லை பூமியில் நாம் வாழும் காலம் தோறும் உண்மையில் உன் ஜீவன் என்னைச் சேரும்🎼",
	"🎼அன்பே அன்பே உன் பார்வை போதும் வானம் மேல நிலவு தேவை இல்லை உன் வாசம் போதும் பூமி எங்கும் பூக்கள் தேவை இல்லை🎼",
	"🎼உன் புன்னகையின் பின்னணியில் சிலரில் சோகம் எப்போதும் யாரென்றே நீ அறியா இதயங்களில் மழையினால் நான் என்றே கண்டும் ஏன் பொழியாமல் நீங்கி போனாய்🎼",
	"🎼போ உறவே என்னை மறந்து நீ உந்தன் கனவுகள் துரதியே போ உறவே சிறகு அணிந்து நீ உந்தன் கணங்களை உதறியே🎼",
	"🎼மாற்றங்கள் அதையும் தூரங்கள் இதையும் என் சிறு இதயம் பழகுதடி நீ அற்ற இரவு வீட்டுக்குள் துறவு ஏன் இந்த உறவு விலகுதடி🎼",
	"🎼இது நிலை இல்லை வெறும் மழை என்றோ இது மழை இல்லை சிறு மழை என்றோ இந்த நொடிகள் கனவே எனவே உறவே சத்தமிட்டு சொல்லிவிட்டு முத்தமிட்டு தள்ளிவிட்டு🎼",
	"🎼எள்ளு வய பூக்கலையே ஏறெடுத்தும் பாக்கலையே🎼",
	"🎼வாள் ஏந்தி வந்தாலும் வாழாம செத்தாலும் கம்பீரம் கொறைஞ்சிடாத நெருப்பு நீ🎼",
	"🎼ஹே என் கோலி சோடாவே என் கறி கொழம்பே உன் குட்டி பப்பி நான் டேக் மீ டேக் மீ🎼",
	"🎼கரை வந்த பிறகே பிடிக்குது கடலை நரை வந்த பிறகே புரியுது உலகை🎼",
	"🎼லாலி பப்பு லாலி பப்பு போல் இனிக்கும் மனசு ஜாலி டைப்பு பாட்டு கேட்டா ஆடுகின்ற வயசு🎼",
	"🎼உன்னை நினைத்து நான் என்னை மறப்பது அதுதான் அன்பே காதல் காதல் காதல் காதல்🎼",
	"🎼ஒன்ன விட்டா யாரும் எனக்கில்லை பாரு ... பாரு ... என்ன கண்டேன் நானும் உனக்குள்ள🎼",
	"🎼என் சண்டகாரி நீதான் என் சண்டகோழி நீதான் சத்தியமா இனிமேல் என் சொந்தமெல்லாம் நீதான்🎼"
 )

QUOTE_STRINGS = (
	"கடந்து போன நாட்களில் உன் துன்பத்திற்கான காரணத்தை பட்டியலிடு இனி கடக்க போகும் நாட்களில் அவை மீண்டும் நிகழாமல் தடுக்கலாம்...",
	"காத்திருக்கும் பொறுமை நமக்கிருந்தாலும் காலத்துக்கு இல்லை...",
	"மனமும் கண்ணாடியை போல் தான் உடையும் வரை யாரையும் காயப்படுத்துவதில்லை...",
	"இளமையில் உன் சேமிப்பு மட்டுமே முதுமையில் உனக்கு கைகொடுக்கும் அடுத்தவர் கையை நம்பி வாழும் வாழ்க்கை நரகம்...",
	"நம்மை நாம் கேள்வி கேட்காத வரையில் நம் தவறுகளை நாம் உணர போவதில்லை...",
	"குறைகள் இருப்பது இயல்பு அதை மதிக்கொண்டு ஜெயிப்பது தான் மதிப்பு",
	"மனம் விசித்திரமானது கிடைத்ததை நினைத்து நிறைவடையாது கிடைக்காததை நினைத்து தவிக்கும்...",
	"இருளான வாழ்க்கை என்று கவலை கொள்ளாதே கனவுகள் முளைப்பது இருளில் தான்...",
	"அம்பினால் பட்ட காயம் ஆறும் அன்பினால் பட்டகாயம் ஆறாது",
	"தலையெழுத்தை மாற்றும் திறமை யாருக்கும் இல்லை எது நடக்குமோ அது நடந்தே ஆகும்..."
)

PROVERB_STRINGS = (
	"ஊரான் பிள்ளையை ஊட்டி வளர்த்தால் தன் பிள்ளை தானே வளரும். _உண்மையான பொருள்:_ ஊரான் வீட்டு பிள்ளையாகிய உன் கர்ப்பிணி மனைவியை பாசத்துடன் ஊட்டி வளர்த்தால், அவள் வயற்றில் இருக்கும்  உன் குழந்தையும், ஆரோக்கியமாக தானே வளரும் என்பதே உண்மையான பொருள்.",
	"கழுதைக்கு தெரியுமா கற்பூர வாசனை. _உண்மையான பொருள்:_ 'கழு தைக்க தெரியுமாம் கற்பூர வாசனை'. கழு என்பது ஒரு வகை கோரைப்புல். அதில் பாய் தைத்து படுத்து பார்த்தால் கற்பூர வாசனை தெரியும் என்பதே சரியான விளக்கம்.",
	"ஆயிரம் பேரை கொன்றவன் அரை வைத்தியன் ஆவான். _உண்மையான பொருள்:_ ஆயிரம் வேரை கொண்டவன் அரை வைத்தியன் ஆவான். நோயை போக்க ஆயிரம் வேரை கொண்டு மருந்து கொடுப்பவன் அரை வைத்தியன் ஆவான்.",
	"அரசனை நம்பி புருசனைக் கைவிட்டது போல! _உண்மையான பொருள்:_ அரசினை நம்பி புருசனைக் கைவிட்டது போல அரசினை என்பது அரச மரத்தை குறிக்கும். திருமணமான பெண்கள் பிள்ளைப்பேறு பெற அரச மரத்தை சுற்றுவார்கள். கட்டிய கணவனை கவனிக்காமல் வெறும் அரச மரத்தை சுற்றுவது பயன் தராது.",
	"களவும் கற்று மற. _உண்மையான பொருள்:_ களவும், கத்தும் மற. களவு-திருடுதல்; கத்து-பொய் சொல்லுதல். தீய பழக்கமான திருடுதல், பொய் சொல்லுதல் இவற்றை ஒருவன் தன் வாழ்நாளில் மறந்து ஒழுக்கமாக இருக்க வேண்டும்."
)

@run_async
def abuse(bot: Bot, update: Update):
    bot.sendChatAction(update.effective_chat.id, "typing") # Bot typing before send messages
    message = update.effective_message
    if message.reply_to_message:
      message.reply_to_message.reply_text(random.choice(ABUSE_STRINGS))
    else:
      message.reply_text(random.choice(ABUSE_STRINGS))

@run_async
def sing(bot: Bot, update: Update):
    bot.sendChatAction(update.effective_chat.id, "typing") # Bot typing before send messages
    message = update.effective_message
    if message.reply_to_message:
      message.reply_to_message.reply_text(random.choice(SONG_STRINGS))
    else:
      message.reply_text(random.choice(SONG_STRINGS))

@run_async
def quote(bot: Bot, update: Update):
    bot.sendChatAction(update.effective_chat.id, "typing") # Bot typing before send messages
    message = update.effective_message
    if message.reply_to_message:
      message.reply_to_message.reply_text(random.choice(QUOTE_STRINGS))
    else:
      message.reply_text(random.choice(QUOTE_STRINGS))

@run_async
def proverb(bot: Bot, update: Update):
    bot.sendChatAction(update.effective_chat.id, "typing") # Bot typing before send messages
    message = update.effective_message
    if message.reply_to_message:
      message.reply_to_message.reply_text(random.choice(PROVERB_STRINGS))
    else:
      message.reply_text(random.choice(PROVERB_STRINGS))
	  
	  
__help__ = """
- /abuse : Abuse someone in Tamil.
- /sing : First lines of some random Tamil Songs.
- /quote : Quote of the Day in Tamil.
- /proverb : Proverbs and there original meanings in Tamil.
"""

__mod_name__ = "ABUSE🤬"

ABUSE_HANDLER = DisableAbleCommandHandler("abuse", abuse)
SING_HANDLER = DisableAbleCommandHandler("sing", sing)
QUOTE_HANDLER = DisableAbleCommandHandler("quote", quote)
PROVERB_HANDLER = DisableAbleCommandHandler("proverb", proverb)

dispatcher.add_handler(ABUSE_HANDLER)
dispatcher.add_handler(SING_HANDLER)
dispatcher.add_handler(QUOTE_HANDLER)
dispatcher.add_handler(PROVERB_HANDLER)
